hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_sysctl_regs.h
/* Bitfield definition for register of struct array CPU: STATUS0 */
/*
 * STATUS (RO)
 *
 * IRQ values
 */
#define SYSCTL_CPU_WAKEUP_STATUS_STATUS_MASK (0xFFFFFFFFUL)
#define SYSCTL_CPU_WAKEUP_STATUS_STATUS_SHIFT (0U)
#define SYSCTL_CPU_WAKEUP_STATUS_STATUS_GET(x) (((uint32_t)(x) & SYSCTL_CPU_WAKEUP_STATUS_STATUS_MASK) >> SYSCTL_CPU_WAKEUP_STATUS_STATUS_SHIFT)

/* Bitfield definition for register of struct array CPU: ENABLE0 */
/*
 * ENABLE (RW)
 *
 * IRQ wakeup enable
 */
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_MASK (0xFFFFFFFFUL)
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_SHIFT (0U)
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_SET(x) (((uint32_t)(x) << SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_SHIFT) & SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_MASK)
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_GET(x) (((uint32_t)(x) & SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_MASK) >> SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_SHIFT)



/* RESOURCE register group index macro definition */
#define SYSCTL_RESOURCE_CPU0 (0UL)
#define SYSCTL_RESOURCE_CPX0 (1UL)
#define SYSCTL_RESOURCE_CPU1 (8UL)
#define SYSCTL_RESOURCE_CPX1 (9UL)
#define SYSCTL_RESOURCE_POW_CPU0 (21UL)
#define SYSCTL_RESOURCE_POW_CPU1 (22UL)
#define SYSCTL_RESOURCE_RST_SOC (23UL)
#define SYSCTL_RESOURCE_RST_CPU0 (24UL)
#define SYSCTL_RESOURCE_RST_CPU1 (25UL)
#define SYSCTL_RESOURCE_CLK_SRC_XTAL (32UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL0 (33UL)
#define SYSCTL_RESOURCE_CLK_SRC_CLK0_PLL0 (34UL)
#define SYSCTL_RESOURCE_CLK_SRC_CLK1_PLL0 (35UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL1 (36UL)
#define SYSCTL_RESOURCE_CLK_SRC_CLK0_PLL1 (37UL)
#define SYSCTL_RESOURCE_CLK_SRC_CLK1_PLL1 (38UL)
#define SYSCTL_RESOURCE_CLK_SRC_CLK2_PLL1 (39UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL2 (40UL)
#define SYSCTL_RESOURCE_CLK_SRC_CLK0_PLL2 (41UL)
#define SYSCTL_RESOURCE_CLK_SRC_CLK1_PLL2 (42UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL0_REF (43UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL1_REF (44UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL2_REF (45UL)
#define SYSCTL_RESOURCE_CLK_TOP_CPU0 (64UL)
#define SYSCTL_RESOURCE_CLK_TOP_MCT0 (65UL)
#define SYSCTL_RESOURCE_CLK_TOP_CPU1 (66UL)
#define SYSCTL_RESOURCE_CLK_TOP_MCT1 (67UL)
#define SYSCTL_RESOURCE_CLK_TOP_AHB0 (68UL)
#define SYSCTL_RESOURCE_CLK_TOP_AXIF (69UL)
#define SYSCTL_RESOURCE_CLK_TOP_AXIS (70UL)
#define SYSCTL_RESOURCE_CLK_TOP_AXIC (71UL)
#define SYSCTL_RESOURCE_CLK_TOP_TMR0 (72UL)
#define SYSCTL_RESOURCE_CLK_TOP_TMR1 (73UL)
#define SYSCTL_RESOURCE_CLK_TOP_TMR2 (74UL)
#define SYSCTL_RESOURCE_CLK_TOP_TMR3 (75UL)
#define SYSCTL_RESOURCE_CLK_TOP_I2C0 (76UL)
#define SYSCTL_RESOURCE_CLK_TOP_I2C1 (77UL)
#define SYSCTL_RESOURCE_CLK_TOP_I2C2 (78UL)
#define SYSCTL_RESOURCE_CLK_TOP_I2C3 (79UL)
#define SYSCTL_RESOURCE_CLK_TOP_SPI0 (80UL)
#define SYSCTL_RESOURCE_CLK_TOP_SPI1 (81UL)
#define SYSCTL_RESOURCE_CLK_TOP_SPI2 (82UL)
#define SYSCTL_RESOURCE_CLK_TOP_SPI3 (83UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT0 (84UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT1 (85UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT2 (86UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT3 (87UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT4 (88UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT5 (89UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT6 (90UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT7 (91UL)
#define SYSCTL_RESOURCE_CLK_TOP_CAN0 (92UL)
#define SYSCTL_RESOURCE_CLK_TOP_CAN1 (93UL)
#define SYSCTL_RESOURCE_CLK_TOP_CAN2 (94UL)
#define SYSCTL_RESOURCE_CLK_TOP_CAN3 (95UL)
#define SYSCTL_RESOURCE_CLK_TOP_XPI0 (96UL)
#define SYSCTL_RESOURCE_CLK_TOP_FEMC (97UL)
#define SYSCTL_RESOURCE_CLK_TOP_ETH0 (98UL)
#define SYSCTL_RESOURCE_CLK_TOP_PTP0 (99UL)
#define SYSCTL_RESOURCE_CLK_TOP_REF0 (100UL)
#define SYSCTL_RESOURCE_CLK_TOP_REF1 (101UL)
#define SYSCTL_RESOURCE_CLK_TOP_NTM0 (102UL)
#define SYSCTL_RESOURCE_CLK_TOP_ANA0 (103UL)
#define SYSCTL_RESOURCE_CLK_TOP_ANA1 (104UL)
#define SYSCTL_RESOURCE_CLK_TOP_ANA2 (105UL)
#define SYSCTL_RESOURCE_CLK_TOP_ANA3 (106UL)
#define SYSCTL_RESOURCE_CLK_TOP_AUD0 (107UL)
#define SYSCTL_RESOURCE_CLK_TOP_AUD1 (108UL)
#define SYSCTL_RESOURCE_CLK_TOP_ADC0 (113UL)
#define SYSCTL_RESOURCE_CLK_TOP_ADC1 (114UL)
#define SYSCTL_RESOURCE_CLK_TOP_ADC2 (115UL)
#define SYSCTL_RESOURCE_CLK_TOP_ADC3 (116UL)
#define SYSCTL_RESOURCE_CLK_TOP_I2S0 (117UL)
#define SYSCTL_RESOURCE_CLK_TOP_I2S1 (118UL)
#define SYSCTL_RESOURCE_AHBP (256UL)
#define SYSCTL_RESOURCE_AXIS (257UL)
#define SYSCTL_RESOURCE_AXIC (258UL)
#define SYSCTL_RESOURCE_ROM0 (259UL)
#define SYSCTL_RESOURCE_LMM0 (260UL)
#define SYSCTL_RESOURCE_MCT0 (261UL)
#define SYSCTL_RESOURCE_LMM1 (262UL)
#define SYSCTL_RESOURCE_MCT1 (263UL)
#define SYSCTL_RESOURCE_TMR0 (264UL)
#define SYSCTL_RESOURCE_TMR1 (265UL)
#define SYSCTL_RESOURCE_TMR2 (266UL)
#define SYSCTL_RESOURCE_TMR3 (267UL)
#define SYSCTL_RESOURCE_I2C0 (268UL)
#define SYSCTL_RESOURCE_I2C1 (269UL)
#define SYSCTL_RESOURCE_I2C2 (270UL)
#define SYSCTL_RESOURCE_I2C3 (271UL)
#define SYSCTL_RESOURCE_SPI0 (272UL)
#define SYSCTL_RESOURCE_SPI1 (273UL)
#define SYSCTL_RESOURCE_SPI2 (274UL)
#define SYSCTL_RESOURCE_SPI3 (275UL)
#define SYSCTL_RESOURCE_URT0 (276UL)
#define SYSCTL_RESOURCE_URT1 (277UL)
#define SYSCTL_RESOURCE_URT2 (278UL)
#define SYSCTL_RESOURCE_URT3 (279UL)
#define SYSCTL_RESOURCE_URT4 (280UL)
#define SYSCTL_RESOURCE_URT5 (281UL)
#define SYSCTL_RESOURCE_URT6 (282UL)
#define SYSCTL_RESOURCE_URT7 (283UL)
#define SYSCTL_RESOURCE_CRC0 (284UL)
#define SYSCTL_RESOURCE_TSNS (285UL)
#define SYSCTL_RESOURCE_WDG0 (286UL)
#define SYSCTL_RESOURCE_WDG1 (287UL)
#define SYSCTL_RESOURCE_WDG2 (288UL)
#define SYSCTL_RESOURCE_WDG3 (289UL)
#define SYSCTL_RESOURCE_MBX0 (290UL)
#define SYSCTL_RESOURCE_MBX1 (291UL)
#define SYSCTL_RESOURCE_GPIO (292UL)
#define SYSCTL_RESOURCE_PPI0 (293UL)
#define SYSCTL_RESOURCE_HDMA (294UL)
#define SYSCTL_RESOURCE_LOBS (295UL)
#define SYSCTL_RESOURCE_ADC0 (296UL)
#define SYSCTL_RESOURCE_ADC1 (297UL)
#define SYSCTL_RESOURCE_ADC2 (298UL)
#define SYSCTL_RESOURCE_ADC3 (299UL)
#define SYSCTL_RESOURCE_DAC0 (300UL)
#define SYSCTL_RESOURCE_DAC1 (301UL)
#define SYSCTL_RESOURCE_CMP0 (302UL)
#define SYSCTL_RESOURCE_CMP1 (303UL)
#define SYSCTL_RESOURCE_CMP2 (304UL)
#define SYSCTL_RESOURCE_CMP3 (305UL)
#define SYSCTL_RESOURCE_I2S0 (306UL)
#define SYSCTL_RESOURCE_I2S1 (307UL)
#define SYSCTL_RESOURCE_PDM0 (308UL)
#define SYSCTL_RESOURCE_CLSD (309UL)
#define SYSCTL_RESOURCE_CAN0 (310UL)
#define SYSCTL_RESOURCE_CAN1 (311UL)
#define SYSCTL_RESOURCE_CAN2 (312UL)
#define SYSCTL_RESOURCE_CAN3 (313UL)
#define SYSCTL_RESOURCE_PTPC (314UL)
#define SYSCTL_RESOURCE_QEI0 (315UL)
#define SYSCTL_RESOURCE_QEI1 (316UL)
#define SYSCTL_RESOURCE_QEO0 (317UL)
#define SYSCTL_RESOURCE_QEO1 (318UL)
#define SYSCTL_RESOURCE_PWM0 (319UL)
#define SYSCTL_RESOURCE_PWM1 (320UL)
#define SYSCTL_RESOURCE_PWM2 (321UL)
#define SYSCTL_RESOURCE_PWM3 (322UL)
#define SYSCTL_RESOURCE_RDC0 (323UL)
#define SYSCTL_RESOURCE_SDM0 (324UL)
#define SYSCTL_RESOURCE_PLB0 (325UL)
#define SYSCTL_RESOURCE_SEI0 (326UL)
#define SYSCTL_RESOURCE_MTG0 (327UL)
#define SYSCTL_RESOURCE_VSC0 (328UL)
#define SYSCTL_RESOURCE_CLC0 (329UL)
#define SYSCTL_RESOURCE_EMDS (330UL)
#define SYSCTL_RESOURCE_RNG0 (331UL)
#define SYSCTL_RESOURCE_SDP0 (332UL)
#define SYSCTL_RESOURCE_KMAN (333UL)
#define SYSCTL_RESOURCE_XPI0 (334UL)
#define SYSCTL_RESOURCE_FEMC (335UL)
#define SYSCTL_RESOURCE_RAM0 (336UL)
#define SYSCTL_RESOURCE_XDMA (337UL)
#define SYSCTL_RESOURCE_FFA0 (338UL)
#define SYSCTL_RESOURCE_ETH0 (339UL)
#define SYSCTL_RESOURCE_USB0 (340UL)
#define SYSCTL_RESOURCE_NTM0 (341UL)
#define SYSCTL_RESOURCE_REF0 (342UL)
#define SYSCTL_RESOURCE_REF1 (343UL)

/* GROUP0 register group index macro definition */
#define SYSCTL_GROUP0_LINK0 (0UL)
#define SYSCTL_GROUP0_LINK1 (1UL)
#define SYSCTL_GROUP0_LINK2 (2UL)

/* GROUP1 register group index macro definition */
#define SYSCTL_GROUP1_LINK0 (0UL)
#define SYSCTL_GROUP1_LINK1 (1UL)
#define SYSCTL_GROUP1_LINK2 (2UL)

/* AFFILIATE register group index macro definition */
#define SYSCTL_AFFILIATE_CPU0 (0UL)
#define SYSCTL_AFFILIATE_CPU1 (1UL)

