hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_sysctl_regs.h
/* RETENTION register group index macro definition */
#define SYSCTL_RETENTION_CPU0 (0UL)
#define SYSCTL_RETENTION_CPU1 (1UL)

/* POWER register group index macro definition */
#define SYSCTL_POWER_CPU0 (0UL)
#define SYSCTL_POWER_CPU1 (1UL)

/* RESET register group index macro definition */
#define SYSCTL_RESET_SOC (0UL)
#define SYSCTL_RESET_CPU0 (1UL)
#define SYSCTL_RESET_CPU1 (2UL)

/* CLOCK register group index macro definition */
#define SYSCTL_CLOCK_CLK_TOP_CPU0 (0UL)
#define SYSCTL_CLOCK_CLK_TOP_MCT0 (1UL)
#define SYSCTL_CLOCK_CLK_TOP_CPU1 (2UL)
#define SYSCTL_CLOCK_CLK_TOP_MCT1 (3UL)
#define SYSCTL_CLOCK_CLK_TOP_AHB0 (4UL)
#define SYSCTL_CLOCK_CLK_TOP_AXIF (5UL)
#define SYSCTL_CLOCK_CLK_TOP_AXIS (6UL)
#define SYSCTL_CLOCK_CLK_TOP_AXIC (7UL)
#define SYSCTL_CLOCK_CLK_TOP_TMR0 (8UL)
#define SYSCTL_CLOCK_CLK_TOP_TMR1 (9UL)
#define SYSCTL_CLOCK_CLK_TOP_TMR2 (10UL)
#define SYSCTL_CLOCK_CLK_TOP_TMR3 (11UL)
#define SYSCTL_CLOCK_CLK_TOP_I2C0 (12UL)
#define SYSCTL_CLOCK_CLK_TOP_I2C1 (13UL)
#define SYSCTL_CLOCK_CLK_TOP_I2C2 (14UL)
#define SYSCTL_CLOCK_CLK_TOP_I2C3 (15UL)
#define SYSCTL_CLOCK_CLK_TOP_SPI0 (16UL)
#define SYSCTL_CLOCK_CLK_TOP_SPI1 (17UL)
#define SYSCTL_CLOCK_CLK_TOP_SPI2 (18UL)
#define SYSCTL_CLOCK_CLK_TOP_SPI3 (19UL)
#define SYSCTL_CLOCK_CLK_TOP_URT0 (20UL)
#define SYSCTL_CLOCK_CLK_TOP_URT1 (21UL)
#define SYSCTL_CLOCK_CLK_TOP_URT2 (22UL)
#define SYSCTL_CLOCK_CLK_TOP_URT3 (23UL)
#define SYSCTL_CLOCK_CLK_TOP_URT4 (24UL)
#define SYSCTL_CLOCK_CLK_TOP_URT5 (25UL)
#define SYSCTL_CLOCK_CLK_TOP_URT6 (26UL)
#define SYSCTL_CLOCK_CLK_TOP_URT7 (27UL)
#define SYSCTL_CLOCK_CLK_TOP_CAN0 (28UL)
#define SYSCTL_CLOCK_CLK_TOP_CAN1 (29UL)
#define SYSCTL_CLOCK_CLK_TOP_CAN2 (30UL)
#define SYSCTL_CLOCK_CLK_TOP_CAN3 (31UL)
#define SYSCTL_CLOCK_CLK_TOP_XPI0 (32UL)
#define SYSCTL_CLOCK_CLK_TOP_FEMC (33UL)
#define SYSCTL_CLOCK_CLK_TOP_ETH0 (34UL)
#define SYSCTL_CLOCK_CLK_TOP_PTP0 (35UL)
#define SYSCTL_CLOCK_CLK_TOP_REF0 (36UL)
#define SYSCTL_CLOCK_CLK_TOP_REF1 (37UL)
#define SYSCTL_CLOCK_CLK_TOP_NTM0 (38UL)
#define SYSCTL_CLOCK_CLK_TOP_ANA0 (39UL)
#define SYSCTL_CLOCK_CLK_TOP_ANA1 (40UL)
#define SYSCTL_CLOCK_CLK_TOP_ANA2 (41UL)
#define SYSCTL_CLOCK_CLK_TOP_ANA3 (42UL)
#define SYSCTL_CLOCK_CLK_TOP_AUD0 (43UL)
#define SYSCTL_CLOCK_CLK_TOP_AUD1 (44UL)

/* ADCCLK register group index macro definition */
#define SYSCTL_ADCCLK_CLK_TOP_ADC0 (0UL)
#define SYSCTL_ADCCLK_CLK_TOP_ADC1 (1UL)
#define SYSCTL_ADCCLK_CLK_TOP_ADC2 (2UL)
#define SYSCTL_ADCCLK_CLK_TOP_ADC3 (3UL)

/* I2SCLK register group index macro definition */
#define SYSCTL_I2SCLK_CLK_TOP_I2S0 (0UL)
#define SYSCTL_I2SCLK_CLK_TOP_I2S1 (1UL)

/* MONITOR register group index macro definition */
#define SYSCTL_MONITOR_SLICE0 (0UL)
#define SYSCTL_MONITOR_SLICE1 (1UL)
#define SYSCTL_MONITOR_SLICE2 (2UL)
#define SYSCTL_MONITOR_SLICE3 (3UL)

/* GPR register group index macro definition */
#define SYSCTL_CPU_GPR_GPR0 (0UL)
#define SYSCTL_CPU_GPR_GPR1 (1UL)
#define SYSCTL_CPU_GPR_GPR2 (2UL)
#define SYSCTL_CPU_GPR_GPR3 (3UL)
#define SYSCTL_CPU_GPR_GPR4 (4UL)
#define SYSCTL_CPU_GPR_GPR5 (5UL)
#define SYSCTL_CPU_GPR_GPR6 (6UL)
#define SYSCTL_CPU_GPR_GPR7 (7UL)
#define SYSCTL_CPU_GPR_GPR8 (8UL)
#define SYSCTL_CPU_GPR_GPR9 (9UL)
#define SYSCTL_CPU_GPR_GPR10 (10UL)
#define SYSCTL_CPU_GPR_GPR11 (11UL)
#define SYSCTL_CPU_GPR_GPR12 (12UL)
#define SYSCTL_CPU_GPR_GPR13 (13UL)

/* WAKEUP_STATUS register group index macro definition */
#define SYSCTL_CPU_WAKEUP_STATUS_STATUS0 (0UL)
#define SYSCTL_CPU_WAKEUP_STATUS_STATUS1 (1UL)
#define SYSCTL_CPU_WAKEUP_STATUS_STATUS2 (2UL)
#define SYSCTL_CPU_WAKEUP_STATUS_STATUS3 (3UL)

/* WAKEUP_ENABLE register group index macro definition */
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE0 (0UL)
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE1 (1UL)
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE2 (2UL)
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE3 (3UL)

/* CPU register group index macro definition */
#define SYSCTL_CPU_CPU0 (0UL)
#define SYSCTL_CPU_CPU1 (1UL)


#endif /* HPM_SYSCTL_H */
